// 귀차니즘 이므로 한글~
// 선반 object 0 ~ 99
public enum SHELF_OBJECT
{
    썬칩 = 0,
    새우깡,
    허니버터칩,
    포카칩,
    꼬깔콘,
    오레오,
    초코파이,
    초코칩_쿠키,
    버터링,
    쿠크다스,
    가나,
    크런키,
    하리보,
    왓따,
    자일리톨,
    포켓몬빵,
    단팥빵,
    보름달,
    삼립호빵,
    스트로베리데니쉬,
    치약,
    칫솔,
    가글,
    휴지,
    물티슈,
    건전지,
    왁스,
    스타킹,
    세제,
    봉지_라면_1,
    봉지_라면_2,
    봉지_라면_3,
    봉지_라면_4,
    봉지_라면_5,
    컵라면_1,
    컵라면_2,
    컵라면_3,
    컵라면_4,
    컵라면_5,
    컵밥_1,
    컵밥_2,
    컵밥_3,
}


// 냉동식품 100 ~ 199
public enum FREEZER_OBEJCT
{
    돼지바 = 100,
    메로나,
    빠삐코,
    뽕따,
    호두마루,
    월드컵,
    나뚜루,
    부라보콘,
    투게더,
}

// 음료수  200 ~ 299
// Ex = 1.5L
public enum DRINK_OBJECT
{
    삼다수_Ex = 200,
    코카콜라_Ex,
    파워에이드_Ex,
    게토레이_Ex,
    코카콜라_500,
    칠성사이다_500,
    밀키스_500,
    토레타_500,
    몬스터_에너지_울트라,
    코카콜라,
    립톤,
    래쓰비,
    만들기_쉬운_물_Ex,
    만들기_쉬운_물,
}

// 핫바 같은거 들어가있는 냉장고 300 ~ 399
public enum FRIDER_OBJECT
{
    삼각김밥_1 = 300,
    삼각김밥_2,
    삼각김밥_3,
    직사각형_모양_도시락_1,
    직사각형_모양_도시락_2,
    직사각형_모양_도시락_3,
    샌드위치_1,
    샌드위치_2,
    김밥_1,
    김밥_2,
    핫바_1,
    핫바_2,
    핫바_3,
    박스형_식품_1,
    박스형_식품_2,
    박스형_식품_3,
    박스형_식품_4,
    박스형_식품_5,
    바리스타룰스,
    스타벅스_카페라떼,
}

public enum ITEM_ACTIVE
{
    NONE = 0,
    CLICK,
    HOLD,
    DROP
}